{"slug":"hello-motivation","metadata":{"title":"Hello Motivation","pubdate":"2020-03-24","smallImage":"images/articles/hello-motivation/desk.jpg","desc":"I have a terrible habit of never writing about the things I make. This site is my attempt to fix that...","date":"24th March 2020"},"html":"<p class=\"mb-4\">(Ironically it took me ages to even begin writing this, although my brain is <a class=\"colorLink\" href=\"https://www.trusselltrust.org/coronavirus-food-banks/\" target=\"_blank\" rel=\"noopener noreferrer\">admittedly</a> and <a class=\"colorLink\" href=\"https://england.shelter.org.uk/donate\" target=\"_blank\" rel=\"noopener noreferrer\">understandably</a> somewhat <a class=\"colorLink\" href=\"https://www.mentalhealth.org.uk/publications/looking-after-your-mental-health-during-coronavirus-outbreak\" target=\"_blank\" rel=\"noopener noreferrer\">distracted</a> right now...)</p>\n<p class=\"mb-4\">Up to this point, I&#39;ve been absolutely awful at writing about my personal projects. Whether it&#39;s space data processing, plotter code writing, or <a class=\"colorLink\" href=\"https://empresseffects.com/products/zoia\" target=\"_blank\" rel=\"noopener noreferrer\">ZOIA</a> format deciphering, I&#39;ve shared almost exactly no details about how or why I&#39;m doing any of it. Due to a somewhat miscalibrated belief that things I create need to be <em>perfect</em> before I send them out into the world, I err on the side of saying nothing whatsoever (with the main exception being <a class=\"colorLink\" href=\"./projects/areo-browser\">Areo Browser</a>, a site that I&#39;m immensely proud of, but also deem <em>finished</em> enough to be a <em>complete product</em> that can be safely be presented as such).</p>\n<p class=\"mb-4\">The other reason is that it&#39;s always been too tricky to simply share things. I&#39;ve had a few personal sites in the past, but none of them made it <em>easy enough</em> to share code, data, live <a class=\"colorLink\" href=\"https://threejs.org/\" target=\"_blank\" rel=\"noopener noreferrer\">ThreeJS</a>/WebGL content, or tutorials in the way that I wanted.</p>\n<p class=\"mb-4\">Which brings me to <em>this</em> post on <em>this</em> new site. Written using <a class=\"colorLink\" href=\"https://sapper.svelte.dev/\" target=\"_blank\" rel=\"noopener noreferrer\">Sapper</a> and <a class=\"colorLink\" href=\"https://tailwindcss.com/\" target=\"_blank\" rel=\"noopener noreferrer\">TailwindCSS</a>, and hosted for free on <a class=\"colorLink\" href=\"https://pages.github.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Github Pages</a>, it finally gives me a way to write the probably short, almost-certainly incredibly niche posts that have been swirling around in my brain for the last few years.</p>\n<p class=\"mb-4\">Going forwards, my goal is to write more often (it&#39;s a low bar), open source as much code as possible, and try to become more comfortable with not waiting until a project is <em>finished</em> before sharing it.</p>\n<p class=\"mb-4\">I think this site is a good start. I mean there&#39;s not even article tags yet... 😬</p>\n","prev":null,"next":null}